refactor: improve docs
